# Цикл
# Создать список из десяти целых чисел.
# Вывести на экран каждое число, увеличенное на 1.

numbers_list = list(range(0,10))
# print(numbers_list)

for n in numbers_list:
    print(n+1)
