# Цикл
# Ввести с клавиатуры строку.
# Вывести эту же строку вертикально: по одному символу на строку консоли.

ask_str = input('Введите строку: ') 
for a in ask_str: 
    print (a)
